share/tutorials/incompressible/piso/les/pitz_daily/0/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            zeroGradient;
  }
  upperWall
  {
    type            zeroGradient;
  }
  lowerWall
  {
    type            zeroGradient;
  }
  frontAndBack
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
