share/tutorials/incompressible/piso/les/pitz_daily/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     mousse-piso;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.1;
deltaT          1e-05;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
  probes
  {
    type            probes;
    functionObjectLibs ("libmousse_sampling.so");
    enabled         true;
    outputControl   timeStep;
    outputInterval  1;
    fields
    (
      p
    );
    probeLocations
    (
      (0.0254 0.0253 0)
      (0.0508 0.0253 0)
      (0.0762 0.0253 0)
      (0.1016 0.0253 0)
      (0.127 0.0253 0)
      (0.1524 0.0253 0)
      (0.1778 0.0253 0)
    );
  }
  fieldAverage1
  {
    type            fieldAverage;
    functionObjectLibs ("libmousse_field_function_objects.so");
    enabled         true;
    outputControl   outputTime;
    fields
    (
      U
      {
        mean        on;
        prime2Mean  on;
        base        time;
      }
      p
      {
        mean        on;
        prime2Mean  on;
        base        time;
      }
    );
  }
  surfaceSampling
  {
    // Sample near-wall velocity
    type surfaces;
    // Where to load it from (if not already in solver)
    functionObjectLibs ("libmousse_sampling.so");
    enabled         true;
    outputControl   outputTime;
    interpolationScheme cellPoint;
    surfaceFormat vtk;
    // Fields to be sampled
    fields
    (
      U
    );
    surfaces
    (
      nearWall
      {
        type            patchInternalField;
        patches         ( lowerWall );
        distance        1E-6;
        interpolate     true;
        triangulate     false;
      }
    );
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
